# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [3]:
#pip install mysql-connector-python

import mysql.connector as sql
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [4]:
connection=sql.connect(host="localhost",user="root",passwd="root")

### You are required to create a database named 'e_commerce'

In [5]:
cursorObject=connection.cursor()

#drop database if exists
query = "DROP DATABASE IF EXISTS e_commerce"
cursorObject.execute(query)

#create database
query = "CREATE DATABASE e_commerce"
cursorObject.execute(query)

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [6]:
#get into database
connection.close()
connection=sql.connect(host="localhost",user="root",passwd="rk@DB$003",database="e_commerce")
cursorObject=connection.cursor()

#create supplier table
query="DROP TABLE IF EXISTS supplier;CREATE TABLE supplier (SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))"
cursorObject.execute(query)
connection.next_result()

#customer customer table
query="DROP TABLE IF EXISTS customer;CREATE TABLE customer (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))"
cursorObject.execute(query)
connection.next_result()


#create category table
query="DROP TABLE IF EXISTS category;CREATE TABLE category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))"
cursorObject.execute(query)
connection.next_result()


#create product table
query="DROP TABLE IF EXISTS product;CREATE TABLE product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))"
cursorObject.execute(query)
connection.next_result()


#create product_details table
query="DROP TABLE IF EXISTS product_details;CREATE TABLE product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))"
cursorObject.execute(query)
connection.next_result()


#create orders table
query="DROP TABLE IF EXISTS orders;CREATE TABLE orders (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))"
cursorObject.execute(query)
connection.next_result()


#create rating table
query="DROP TABLE IF EXISTS rating;CREATE TABLE rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))"
cursorObject.execute(query)
connection.next_result()

True

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [25]:
# insert into "supplier" table
insertQuery="""INSERT INTO SUPPLIER(SUPP_ID,SUPP_NAME,SUPP_CITY,SUPP_PHONE) 
    VALUES (1,'Rajesh Retails','Delhi','1234567890'),
           (2,'Appario Ltd.','Mumbai','258963147'),
           (3,'Knome products','Bangalore','9785462315'),
           (4,'Bansal Retails','Kochi','8975463285'),
           (5,'Mittal Ltd.','Lucknow','7898456532')
"""
cursorObject.execute(insertQuery)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [32]:
# insert into "customer" table
insertQuery="INSERT INTO CUSTOMER (CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER)  VALUES (%s,%s,%s,%s,%s)"
values=[
    (1,'AAKASH','9999999999','DELHI','M'),
    (2,'AMAN','9785463215','NOIDA','M'),
    (3,'NEHA','9999999998','MUMBAI','F'),
    (4,'MEGHA','9994562399','KOLKATA','F'),
    (5,'PULKIT','7895999999','LUCKNOW','M')
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [33]:
# insert into "categoty" table
insertQuery="INSERT INTO CATEGORY (CAT_ID,CAT_NAME)  VALUES (%s,%s)"
values=[
        (1,'BOOKS'),
        (2,'GAMES'),
        (3,'GROCERIES'),
        (4,'ELECTRONICS'),
        (5,'CLOTHES')
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [34]:
# insert into "product" table
insertQuery="INSERT INTO PRODUCT (PRO_ID,PRO_NAME,PRO_DESC,CAT_ID)  VALUES (%s,%s,%s,%s)"
values=[
    (1,'GTA V','DFJDJFDJFDJFDJFJF',2),
    (2,'TSHIRT','DFDFJDFJDKFD',5),
    (3,'ROG LAPTOP','DFNTTNTNTERND',4),
    (4,'OATS','REURENTBTOTH',3),
    (5,'HARRY POTTER','NBEMCTHTJTH',1)
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [35]:
# insert into "product_details" table
insertQuery="INSERT INTO PRODUCT_DETAILS (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE)  VALUES (%s,%s,%s,%s)"
values=[
        (1,1,2,1500),
        (2,3,5,30000),
        (3,5,1,3000),
        (4,2,3,2500),
        (5,4,1,1000)
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [37]:
# insert into "orders" table
insertQuery="INSERT INTO ORDERS (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID)  VALUES (%s,%s,%s,%s,%s)"
values=[
        (20,1500,'2021-10-12',3,5),
        (25,30500,'2021-09-16',5,2),
        (26,2000,'2021-10-05',1,1),
        (30,3500,'2021-08-16',4,3),
        (50,2000,'2021-10-06',2,1)
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [36]:
# insert into "rating" table
insertQuery="INSERT INTO RATING (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS)  VALUES (%s,%s,%s,%s)"
values=[
        (1, 2, 2, 4),
        (2, 3, 4, 3), 
        (3, 5, 1, 5),
        (4, 1, 3, 2),
        (5, 4, 5, 4)
]
cursorObject.executemany(insertQuery,values)
print(cursorObject.rowcount, " rows inserted")
connection.commit()

5  rows inserted

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [53]:
select_query="""
SELECT  COUNT(CUST.CUS_PHONE) AS CUSTOMER_COUNT,
        CUST.CUS_GENDER AS GENDER
FROM CUSTOMER CUST,ORDERS ORD
WHERE ORD.CUS_ID=CUST.CUS_ID AND
      ORD.ORD_AMOUNT >= 3000
GROUP BY CUST.CUS_GENDER
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUSTOMER_COUNT','GENDER'])
output_df

   CUSTOMER_COUNT GENDER
0               1      M
1               1      F

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [91]:
select_query="""
SELECT  ORD.ORD_ID,
        ORD.ORD_AMOUNT,
        ORD.ORD_DATE,
        ORD.CUS_ID,
        ORD.PROD_ID,
        PROD.PRO_ID,
        PRO.PRO_NAME AS PRODUCT_NAME
FROM ORDERS ORD,PRODUCT_DETAILS PROD,PRODUCT PRO
WHERE ORD.PROD_ID=PROD.PROD_ID AND
      PROD.PRO_ID=PRO.PRO_ID AND
      ORD.CUS_ID = 2
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_ID','PRODUCT_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID  PRO_ID PRODUCT_NAME
0      50        2000  2021-10-06       2        1       1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [56]:
select_query="""
SELECT  SUPP.SUPP_ID,
        SUPP.SUPP_NAME,
        SUPP.SUPP_CITY,
        SUPP.SUPP_PHONE
FROM SUPPLIER SUPP,PRODUCT_DETAILS PROD,PRODUCT PRO
GROUP BY PROD.SUPP_ID
HAVING  COUNT(PROD.PRO_ID)>1 AND
        PROD.SUPP_ID=SUPP.SUPP_ID
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [72]:
select_query="""
SELECT  CAT.CAT_ID,
        CAT.CAT_NAME,
        MIN(ORD.ORD_AMOUNT) AS ORD_AMOUNT,
        PRO.PRO_NAME
FROM ORDERS ORD,PRODUCT_DETAILS PROD,PRODUCT PRO,CATEGORY CAT
WHERE ORD.PROD_ID=PROD.PROD_ID AND
      PROD.PRO_ID=PRO.PRO_ID AND
      PRO.CAT_ID=CAT.CAT_ID
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME','ORD_AMOUNT','PRO_NAME'])
output_df

   CAT_ID   CAT_NAME  ORD_AMOUNT PRO_NAME
0       3  GROCERIES        1500     OATS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [73]:
select_query="""
SELECT  PRO.PRO_ID,
        PRO.PRO_NAME
FROM ORDERS ORD,PRODUCT_DETAILS PROD,PRODUCT PRO
WHERE ORD.PROD_ID=PROD.PROD_ID AND
      PROD.PRO_ID=PRO.PRO_ID AND
      ORD.ORD_DATE > '2021-10-05'
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [81]:
select_query="""
SELECT  SUPP.SUPP_ID,
        SUPP.SUPP_NAME,
        RAT.RAT_RATSTARS AS RATING,
        CUST.CUS_NAME
FROM SUPPLIER SUPP,RATING RAT,CUSTOMER CUST
WHERE RAT.SUPP_ID=SUPP.SUPP_ID AND
      RAT.CUS_ID=CUST.CUS_ID
ORDER BY RAT.RAT_RATSTARS DESC
LIMIT 3
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','RATING','CUS_NAME'])
output_df

   SUPP_ID       SUPP_NAME  RATING CUS_NAME
0        1  Rajesh Retails       5   PULKIT
1        2    Appario Ltd.       4     AMAN
2        5     Mittal Ltd.       4    MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [83]:
select_query="""
SELECT  CUS_NAME,
        CUS_GENDER
FROM CUSTOMER
WHERE CUS_NAME LIKE 'A%' OR
      CUS_NAME LIKE '%A'
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [85]:
select_query="""
SELECT  SUM(ORD.ORD_AMOUNT) AS TOTAL_ORDER_AMOUNT
FROM CUSTOMER CUST,ORDERS ORD
WHERE ORD.CUS_ID=CUST.CUS_ID AND
      CUST.CUS_GENDER='M'
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['TOTAL_ORDER_AMOUNT'])
output_df

  TOTAL_ORDER_AMOUNT
0              34500

### Q11) Display all the Customers left outer join with  the orders

In [90]:
select_query="""
SELECT  CUST.CUS_ID,
        CUST.CUS_NAME,
        CUST.CUS_PHONE,
        CUST.CUS_CITY,
        CUST.CUS_GENDER
FROM CUSTOMER CUST
LEFT OUTER JOIN ORDERS ORD
ON CUST.CUS_ID=ORD.CUS_ID
"""
cursorObject.execute(select_query)
output=cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER'])
output_df

   CUS_ID CUS_NAME   CUS_PHONE CUS_CITY CUS_GENDER
0       1   AAKASH  9999999999    DELHI          M
1       2     AMAN  9785463215    NOIDA          M
2       3     NEHA  9999999998   MUMBAI          F
3       4    MEGHA  9994562399  KOLKATA          F
4       5   PULKIT  7895999999  LUCKNOW          M

**NOTE:** Always close an open connection once you are done with the database operations

In [92]:
connection.close()

## Happy Learning:)